<!DOCTYPE html>
<html>
	<head>
		<meta name="layout" content="main"/>
		<title>用前必读${ grailsApplication.config.html.title.suffix }</title>
	</head>
	<body>
		<div class="row">
			<div class="col-md-12">
				<h1 class="bold">使用协议</h1>
				<p style="line-height:30px;font-size:16px;">
					本站文章信息部分来自于网络转载，但这并不意味着赞同其观点或证实其内容的真实性。如其他媒体、网站或个人从本网下载使用，必须保留本网注明的“稿件来源”并自负版权等法律责任。如对稿件内容有疑议，请及时与我们联系。
					<br/>
					本站致力于提供合理、准确、完整的资讯信息，但不保证信息的合理性、准确性和完整性，且不对因信息的不合理、不准确或遗漏导致的任何损失或损害承担责任。本站所有信息仅供参考，不做交易和服务的根据。如自行使用本网资料发生偏差，本站概不负责，亦不负任何法律责任。
					<br/>
					任何由于黑客攻击、计算机病毒侵入或发作、因政府管制而造成的暂时性关闭等影响网络正常经营的不可抗力而造成的损失，本站均得免责。由于与本站链接的其它网站所造成之个人资料泄露及由此而导致的任何法律争议和后果，本站均得免责。
					<br/>
					本站如因系统维护或升级而需暂停服务时，将事先公告。若因线路及非本公司控制范围外的硬件故障或其它不可抗力而导致暂停服务，于暂停服务期间造成的一切不便与损失，本站不负任何责任。
					<br/>
					本站使用者因为违反本声明的规定而触犯中华人民共和国法律的，一切后果自己负责，本站不承担任何责任。
					<br/>
					凡以任何方式登陆本站或直接、间接使用本站资料者，视为自愿接受本站声明的约束。
					<br/>
					本声明未涉及的问题参见国家有关法律法规，当本声明与国家法律法规冲突时，以国家法律法规为准。
					<br/>
					本站如无意中侵犯了哪个媒体或个人的知识产权，请及时告之，本站将立即给予删除。
				</p>

				<div style="float:left;padding-bottom:30px;">
					<h1 class="bold">联系站长</h1>
					<ul style="line-height:30px;">
						<li>姓名：吕常龙</li>
						<li>ＱＱ：417891235</li>
					</ul>
				</div>

				<asset:image src="SuCai/公众号.jpg" style="float:right;bottom:0;width:250px;" title="公众号"/>
			</div>
		</div>
	</body>
</html>